// 1 *************************
// let userName = prompt("Введіть Ваше ім'я");
// alert(`Привіт,${userName}!`);

// 2 *************************
// const year = 2023;
// let age = +prompt("Введіть ваш рік народження");
// alert(`Ваш вік - ${year - age}`);


// 3 *************************
// let side = +prompt('Введіть довжину сторони квадрата.');
// alert(`Периметр квадрата  = ${side*4}см`);

// 4 *************************
// let radius = +prompt("Введіть радіус кола");
// alert(`Радіус кола = ${Math.PI * (radius**2)}`);

// 5 *************************
// let distance = +prompt("Введіть  відстань між містами.");
// let time = +prompt("Введіть кількість годин")
// alert(`Ваша швидкість - ${distance/time}`);

// 6 *************************
// const EUR = 0.93;

// let USD = +prompt("Введіть кількість долларів");
// alert(`Євро: ${USD*EUR}`);

// 7 *************************
// let flashCard  = +prompt("Введіть кількість гігабайт на Вашій флешці.")
// alert(`На вашу флешку помітиться ${Math.floor((flashCard  * 1000) / 820)} файлів розміром 820МБ.`);


// 8 *************************
// const money = +prompt('Введіть кількість грошей');
// const price = +prompt("Введіть вартість однієї шоколадки.");
// const res = money % price;
// alert(`Ви можете придбати ${Math.floor(money / price)} шоколадок, і у Вас залишиться ${res}грн`);


// 9 *************************
// let num = +prompt('Введіть тризначне число.'); // 159 - 951

// let a = num%10; // последняя цифра 
// let b = Math.floor((num%100) / 10); // средняя цифра
// let c = Math.floor((num%1000) / 100)// первая цифра
// alert(`Ваше число-паліндром - ${a}${b}${c}`);

// 10 *************************

// let num = +prompt("Введіть ціле число.");

// (num % 2 == 0 ) && alert('Число парне') || (num % 2 != 0 ) && alert('Число непарне')







